<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Comandos b&aacute;sicos de Karel</title>
</head>
<body
 style="background-image: url(./workbook.gif);">
<center>
<h2>Comandos b&aacute;sicos de  Karel </h2>
</center>
<h4>Hay cinco comandos b&aacute;sicos para Karel, estos son:</h4>
<ol>
 	<li><b>avanza</b>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(avanza
una esquina)
    <p>    </p>
  </li>
  <li><b>gira-izquierda</b>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
(gira a la izquierda)
    <p>      </p>
  </li>
  <li><b>coge-zumbador</b>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(coge
un zumbador)
    <p>    </p>
  </li>
  <li><b>deja-zumbador&nbsp;</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(deja
un zumpador)
    <p>    </p>
  </li>
  <li><b>apagate</b>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(descon&eacute;ctate)
    <p> </p>
  </li>
</ol>
   
<p> <b>La salud de Karel</b></p>
<p> Andar entre muros no es bueno para un robot, por lo tanto Karel tiene
algunos mecanismos salvavidas dentro de &eacute;l. Si un programa le dice
a Karel que se mueva aunque haya un muro delante de &eacute;l, &eacute;l
dir&aacute; que hay un error y no realizar&aacute; la acci&oacute;n. Lo mismo
ocurrir&aacute; si le decimos que coja un zumbador en una esquina y no existe
ninguno. Las &uacute;nicas &oacute;rdenes que siempre lleva a cabo sin importar
la situaci&oacute;n en la que se encuentre son gira-izquierda y apagate.
Cuando Karel nos dice que hay un error, no tenemos que echarle la culpa,
sino que probablemente habremos escrito mal alguna instrucci&oacute;n.</p>
<p><b>Ejercicio 2 : </b> Cada ma&ntilde;ana Karel se levanta de la cama y
tiene que recoger el peri&oacute;dico, representado por un zumbador, que
est&aacute; en el porche de la casa. Escribe un programa que ordene
a Karel que recoja el peri&oacute;dico y lo lleve de vuelta a la cama. La
situaci&oacute;n inicial es la de la imagen de abajo, y la situaci&oacute;n
final debe tener a Karel de vuelta en la cama (misma esquina, misma direcci&oacute;n
que cuando empez&oacute;) con el peri&oacute;dico (zumbador en su mochila).
Crea un mundo como el de la imagen y gu&aacute;rdalo como &#8220;periodico.mdo&#8221;.
</p>
<p>       </p>
<center><img src="image021.jpg" border="1"
 alt="" />
</center>
<center>
<h2>Comandos b&aacute;sicos de  Karel</h2>
<h2 align="left">
  <p align="left"><a href="Karel.html">Regresar</a> </p>
</h2>
</center>
  
</body>
</html>
