<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta charset="UTF-8">
  <title>La sentencia define-nueva-instruccion/como &nbsp;</title>
</head>
<body style="background-image: url(./workbook.gif);">
  <center>
    <h2>La sentencia void</h2>
  </center>Hasta ahora, le hemos dicho a Karel exactamente lo que ten&iacute;a que hacer&nbsp; tal como
  necesit&aacute;bamos que lo hiciese. Esto funciona bien, pero te pudiste haber dado cuenta de que
  siempre se utilizan secuencias de sentencias similares. Un ejemplo es cuando Karel tiene que
  girar a la derecha, y nosotros le decimos " turnleft(); turnleft(); turnleft(); ". &iquest;No ser&iacute;a m&aacute;s
  f&aacute;cil si le pudi&eacute;ramos decir simplemente "turnright()" ?.
  <p>En otras palabras, diciendo "turnright(); " Karel girar&iacute;a tres veces hacia la izquierda para
  alcanzar nuestro objetivo. Es posible. &iquest;Est&aacute;s suficientemente motivado para aprender una nueva
  sentencia?</p>
  <p>Una de las razones de crear nuevas instrucciones, es por evitar escribir tanto. Otra es para
  documentar mejor cual es nuestro objetivo, cuando nosotros mismos u otra persona lee el programa.
  Como te estar&aacute;s dando cuenta, programar es una tarea extremadamente compleja, y &iexcl;necesitamos toda
  la ayuda necesaria para hacer las cosas correctamente !</p>
  <p>Las sentencia <strong>void</strong> (que tambi&eacute;n se puede escribir como
  <strong>define</strong>) est&aacute; situada en un sitio especial dentro de un programa de Karel, justo
  despu&eacute;s de la sentencia "class program {". El siguiente es un programa v&aacute;lido para Karel:</p>
  <p>&nbsp;
  <center>
    <img alt=""
            border="1"
            src="image023b.jpg" />
  </center></p>
  <p>Puedes definir cualquier n&uacute;mero de instrucciones nuevas, y despu&eacute;s usarlas en el programa
  donde las necesites. Las instrucciones nuevas pueden contener sentencias de control, si es
  necesario. Date cuenta de que la nueva instrucci&oacute;n puede tambi&eacute;n usar una instrucci&oacute;n definida
  previamente. El ejercicio 5 podr&iacute;a haberse escrito:&nbsp;</p>
  <p>&nbsp;&nbsp;&nbsp;&nbsp;
  <center>
    <img alt=""
            border="1"
            src="image024b.jpg" />
  </center></p>
  <p>Date cuenta de como la instrucci&oacute;n iterate acaba moviendo a Karel una esquina hacia adelante,
  sin tener en cuenta en nẃ de zumbadores. Si haces esto 14 veces, &iexcl;estar&aacute;s en casa !</p>
  <p><strong>Ejercicio 7:</strong> Re-escribe el programa para el ejercicio 4, pero esta vez puede
  no haber un zumbador en cada esquina. Guarda tu programa con el nombre <tt>diagonal2.txt</tt>.
  &nbsp; La nueva&nbsp; instrucci&oacute;n deber&iacute;a coger un zumbador en la posici&oacute;n actual, si es que lo
  hay. Deber&iacute;as usar esta instrucci&oacute;n para coger todos los zumbadores mientras Karel va a su casa
  en diagonal. Asegurate de que tienes el mundo <tt>diagonal.mdo</tt> cargado para probar tu
  programa. Karel deber&iacute;a finalizar en la esquina de la 1ªCalle con la 1ªAvenida, con todos los
  zumbadores que ha ido cogiendo por el camino, y apagarse.</p>
  <p><strong>Ejercicio 8:</strong> Escribe un programa que ayude a Karel a escapar de un laberinto
  que no contiene islas (cuadrados aislados). La salida del laberinto est&aacute; marcada ubicando un
  zumbador en la primera esquina que est&aacute; fuera del laberinto, al lado del muro de la derecha. Una
  forma de resolver este problema es hacer que Karel avance a lo largo del laberinto siguiendo el
  muro de su derecha ( imagina que est&aacute; tocando el muro y que nunca puede despegar su mano de &eacute;l).
  En la siguiente imagen hay un ejemplo de un laberinto del cual deber&iacute;a ser capaz de salir (no
  olvides que tu programa deber&iacute;a funcionar en todos los laberintos, no solo en el de la imagen).
  Guarda tu programa con el nombre <tt>laberinto.txt</tt>. Esto parece muy, muy complicado. &iquest;Puedes
  darnos un mundo de ejemplo?</p>
  <p>Aqu&iacute; tienes un mundo inicial de ejemplo. La l&iacute;nea roja muestra el camino que deber&iacute;a seguir
  Karel para este mundo. Recuerda que no sabes de antemano donde estar&aacute;n los muros.&nbsp;</p>
  <p>&nbsp;
  <center>
    <img alt=""
            border="1"
            src="image026.jpg" />
  </center></p>
  <p>Podr&iacute;a hacerse m&aacute;s f&aacute;cil si definieras unas pocas nuevas instrucciones que hicieran parte del
  trabajo. Aqu&iacute; ten&eacute;is un ejemplo:</p>
  <p>...</p>
  <p>void sigueMuroDereha() {</p>
  <p>&nbsp;&nbsp; /*pon tu c&oacute;digo aqu&iacute;*/</p>
  <p>}</p>
  <p>...</p>
  <p>Esta instrucci&oacute;n hace que Karel avance correctamente hacia el siguiente segmento de muro. Los
  diagramas de abajo muestran las 4 situaciones, Karel podr&iacute;a estar en cualquier punto del
  laberinto. Si <strong>sigueMuroDerecha()</strong> resuelve correctamente los 4 casos, entonces
  has solucionado la parte principal del problema. Tambi&eacute;n deber&iacute;as definir
  <strong>turnright()</strong>.</p>
  <p>Para probar tu programa crea un mundo como el del ejemplo y gu&aacute;rdalo con el nombre
  <tt>laberinto.mdo</tt>. Una vez te funcione el programa para este mundo, prueba a modificarlo
  antilde;adi&eacute;ndo o quitando muros. &iquest;Realiza Karel la tarea bien <strong>en todos los casos</strong>?</p>
  <p></p>
  <center>
    <table border="2">
      <tr>
        <td><img alt=""
             border="0"
             height="199"
             src="image028.jpg"
             width="198" /></td>
        <td><img alt=""
             border="0"
             height="199"
             src="image032.jpg"
             width="199" /></td>
      </tr>
      <tr>
        <td>
          <center>
            Situaciones iniciales
          </center>
        </td>
        <td>
          <center>
            Movimientos respectivos
          </center>
        </td>
      </tr>
    </table>
  </center>
  <p></p>
  <center>
    <h2>La sentencia void</h2>
    <h2 align="left"><a href="KarelJAVA.html">Regresar</a></h2>
  </center>
</body>
</html>
